InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСВалютами/Ext/Module.bsl
// Функция возвращает актуальный курс валюты на указанную дату.
// Если курс в базе не найден, возвращает 1 (чтобы не делить на ноль при пересчете).
Функция ПолучитьКурсВалюты(АктуальнаяДата, ИскомаяВалюта) Экспорт
	
	// Если валюта не указана, пересчет не требуется
	Если Не ЗначениеЗаполнено(ИскомаяВалюта) Тогда
		Возврат 1;
	КонецЕсли;
	
	// Строим запрос к срезу последних регистра сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
		
	Запрос.УстановитьParamетр("Период", АктуальнаяДата);
	Запрос.УстановитьПараметр("Валюта", ИскомаяВалюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Курс;
	Иначе
		// Если курса нет в базе, возвращаем 1, чтобы не искажать рублевые суммы
		Возврат 1;
	КонецЕсли;
	
КонецФункции
